using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HomeWork_array_6._9
{
    class Program
    {
        static void Main(string[] args)
        {
            #region
            /*
            Используя Visual Studio, создайте проект по шаблону ConsoleApplication.                                       
            Создайте программу, в которой создайте массив целых чисел размерности 10х10 и заполните его случайными элементами.
            Выведете на консоль полученный массив. Найдите суммы элементов каждой строки, произведения элементов каждого столбца,
            и максимальный элемент главной диагонали (подсказка: все элементы, для которых номер строки совпадает с номером столбца).
            */
            #endregion
            Console.WriteLine("Ok)");


            Console.ReadKey();
        }
    }
}
